saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/TexasInstruments.MSP432P4xx_DFP.3.2.6.pdsc
        <!-- *************************  Device MSP432P411Y  ***************************** -->
        <device Dname="MSP432P411Y">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00008000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00040000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00040000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash1024kB.FLM" start="0x00000000" size="0x00100000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash_A.FLM"     start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P411Y.flash"        start="0x00000000" size="0x00100000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P411Y_info.flash"   start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <compile    define="__MSP432P411Y__"/>
          <debug      svd="SVD/MSP432P411Y.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
        <!-- *************************  Device MSP432P411V  ***************************** -->
        <device Dname="MSP432P411V">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00008000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00020000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00020000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash512kB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x01000000" RAMsize="0x0001E000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash_A.FLM"    start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0001E000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P411V.flash"        start="0x00000000" size="0x00080000" RAMstart="0x01000000" RAMsize="0x0001E000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P411V_info.flash"   start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0001E000" default="0" style="IAR"/>
          <compile    define="__MSP432P411V__"/>
          <debug      svd="SVD/MSP432P411V.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
        <!-- *************************  Device MSP432P4011  ***************************** -->
        <device Dname="MSP432P4011">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00200000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00008000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00040000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00040000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash2048kB.FLM" start="0x00000000" size="0x00200000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash.FLM"      start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P4011.flash"        start="0x00000000" size="0x00200000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P4011_info.flash"   start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <compile    define="__MSP432P4011__"/>
          <debug      svd="SVD/MSP432P4011.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
        <!-- *************************  Device MSP432P401Y  ***************************** -->
        <device Dname="MSP432P401Y">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00008000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00040000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00040000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash1024kB.FLM" start="0x00000000" size="0x00100000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash.FLM"      start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P401Y.flash"        start="0x00000000" size="0x00100000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P401Y_info.flash"   start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0003E000" default="0" style="IAR"/>
          <compile    define="__MSP432P401Y__"/>
          <debug      svd="SVD/MSP432P401Y.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
        <!-- *************************  Device MSP432P401V  ***************************** -->
        <device Dname="MSP432P401V">
          <memory     id="IROM1"      access="rx"  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory     id="IROM2"      access="rx"  start="0x00200000" size="0x00008000" startup="0" default="1"/>
          <memory     id="IRAM1"      access="rw"  start="0x20000000" size="0x00020000" default="1"/>
          <memory     id="IRAM2"      access="rwx" start="0x01000000" size="0x00020000" default="0" alias="IRAM1"/>
          <algorithm  name="FlashARM/MSP432P4xx_MainFlash512kB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x01000000" RAMsize="0x0001E000" default="1"/>
          <algorithm  name="FlashARM/MSP432P4xx_InfoFlash.FLM"      start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0001E000" default="1"/>
          <algorithm  name="FlashIAR/FlashMSP432P401V.flash"        start="0x00000000" size="0x00080000" RAMstart="0x01000000" RAMsize="0x0001E000" default="0" style="IAR"/>
          <algorithm  name="FlashIAR/FlashMSP432P401V_info.flash"   start="0x00200000" size="0x00008000" RAMstart="0x01000000" RAMsize="0x0001E000" default="0" style="IAR"/>
          <compile    define="__MSP432P401V__"/>
          <debug      svd="SVD/MSP432P401V.svd"/>
          <environment name="iar">
            <debugger>
              <param name="xdsdevicename" value="MSP432"/>
            </debugger>
          </environment>
        </device>
      </subFamily>
    </family>
  </devices>

 <conditions>
    <condition id="MSP432 CMSIS-CORE">
      <!-- conditions selecting Devices -->
      <description>Texas Instruments MSP432 Family devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432*"/>
    </condition>
    <condition id="isMSP432P401R">
      <description>Texas Instruments MSP432P401R device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P401R"/>
    </condition>
    <condition id="isMSP432P401M">
      <description>Texas Instruments MSP432P401R device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P401M"/>
    </condition>
    <condition id="isMSP432P4111">
      <description>Texas Instruments MSP432P4111 device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P4111"/>
    </condition>
    <condition id="isMSP432P411Y">
      <description>Texas Instruments MSP432P411Y device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P411Y"/>
    </condition>
    <condition id="isMSP432P411V">
      <description>Texas Instruments MSP432P411V device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P411V"/>
    </condition>
    <condition id="isMSP432P4011">
      <description>Texas Instruments MSP432P4011 device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P4011"/>
    </condition>
    <condition id="isMSP432P401Y">
      <description>Texas Instruments MSP432P401Y device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P401Y"/>
    </condition>
    <condition id="isMSP432P401V">
      <description>Texas Instruments MSP432P401V device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="MSP432P401V"/>
    </condition>
    <condition id="Startup ARM">
      <description>Startup assembler file for ARMCC</description>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Startup GCC">
      <description>Startup assembler file for GCC</description>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Startup IAR">
      <description>Startup assembler file for IAR</description>
      <require Tcompiler="IAR"/>
    </condition>  
